<?php

namespace Database\Seeders;

use App\Models\HeaderBanner;
use Illuminate\Database\Seeder;

class HeaderBannerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $arItems = [
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/vacancies',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/blog',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/about',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/commerce',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/salary/create',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/salary',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
            [
                'name' => 'УПРАВЛЯЙ СВОИМИ ОЖИДАНИЯМИ',
                'link' => '/salary/result',
                'description' => 'Узнай <span>зарплату</span> по рынку',
                'mob_picture' => 'img/index-first-block2.png',
                'picture' => 'img/index-first-block.png',
                'text' => 'Мы покажем реальную ситуацию на уровень зарплат разных специализаций в логистической сфере. <br/>
        Принимай участие с нами.',
                'wages_title' => 'Зарплата в логистике',
                'wages' => [
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                    '1352 руб. в месяц <br/>(540,8$)',
                ],
            ],
        ];
        foreach ($arItems as $arItem) {
            HeaderBanner::updateOrCreate(['link' => $arItem['link']], $arItem);
        }
    }
}
