<?php
return [
    'title'=>'Присоединяйтесь к нам',
    'link'=>'У Вас уже есть аккаунт? <a href=":link">Войти</a>',
    'phone'=>'Ваш номер телефона',
    'email'=>'Ваш E-mail',
    'code'=>'Код подтверждения',
    'password'=>'Придумайте пароль <i>(не менее 8 символов)</i>',
    'password_confirm'=>'Повторите пароль',
    'submit'=>'Присоединиться',
    'agreement'=>'<a href="/privacy-policy">Присоединяясь, Вы соглашаетесь с политикой конфиденциальности и пользовательским соглашенем</a>.',
    'confirm_code'=>'Код подтверждения: :code',
    'code_already_send'=>'Код уже отправлен, введите полученный код в поле и повторите попытку',
    'unavailable_code'=>'Указан неверный код подтверждения',
    'info'=>'На ваш мобильный номер выслано sms-сообщение от оператора RSMS.BY с кодом подтверждения, которое придет в течение 1 минуты. Введи код в поле «Код подтверждения» и нажмите кнопку «Присоединиться» снова.'
];
